Model: "model"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 text (InputLayer)              [(None,)]            0           []                               
                                                                                                  
 preprocessing (KerasLayer)     {'input_type_ids':   0           ['text[0][0]']                   
                                (None, 128),                                                      
                                 'input_mask': (Non                                               
                                e, 128),                                                          
                                 'input_word_ids':                                                
                                (None, 128)}                                                      
                                                                                                  
 BERT_encoder (KerasLayer)      {'pooled_output': (  9591041     ['preprocessing[0][0]',          
                                None, 256),                       'preprocessing[0][1]',          
                                 'sequence_output':               'preprocessing[0][2]']          
                                 (None, 128, 256),                                                
                                 'encoder_outputs':                                               
                                 [(None, 128, 256),                                               
                                 (None, 128, 256)],                                               
                                 'default': (None,                                                
                                256)}                                                             
                                                                                                  
 dropout (Dropout)              (None, 256)          0           ['BERT_encoder[0][3]']           
                                                                                                  
 classifier (Dense)             (None, 1)            257         ['dropout[0][0]']                
                                                                                                  
==================================================================================================
Total params: 9,591,298
Trainable params: 9,591,297
Non-trainable params: 1
__________________________________________________________________________________________________
None
Epoch 1/24
 1/44 [..............................] - ETA: 4:29 - loss: 0.7544 - accuracy: 0.4688 - precision: 0.3636 - recall: 0.2857 - auc: 0.4504 2/44 [>.............................] - ETA: 29s - loss: 0.7019 - accuracy: 0.5469 - precision: 0.4857 - recall: 0.6071 - auc: 0.6037  3/44 [=>............................] - ETA: 27s - loss: 0.8015 - accuracy: 0.5625 - precision: 0.4857 - recall: 0.4146 - auc: 0.5951 4/44 [=>............................] - ETA: 27s - loss: 0.7120 - accuracy: 0.6172 - precision: 0.5366 - recall: 0.4231 - auc: 0.6516 5/44 [==>...........................] - ETA: 26s - loss: 0.6766 - accuracy: 0.6375 - precision: 0.5484 - recall: 0.5312 - auc: 0.6808 6/44 [===>..........................] - ETA: 27s - loss: 0.6228 - accuracy: 0.6719 - precision: 0.6000 - recall: 0.5455 - auc: 0.7231 7/44 [===>..........................] - ETA: 26s - loss: 0.5982 - accuracy: 0.6875 - precision: 0.6098 - recall: 0.5682 - auc: 0.7458 8/44 [====>.........................] - ETA: 25s - loss: 0.5643 - accuracy: 0.7188 - precision: 0.6489 - recall: 0.6100 - auc: 0.7805 9/44 [=====>........................] - ETA: 24s - loss: 0.5352 - accuracy: 0.7396 - precision: 0.6602 - recall: 0.6296 - auc: 0.801310/44 [=====>........................] - ETA: 23s - loss: 0.5177 - accuracy: 0.7469 - precision: 0.6545 - recall: 0.6261 - auc: 0.812911/44 [======>.......................] - ETA: 23s - loss: 0.4977 - accuracy: 0.7642 - precision: 0.6780 - recall: 0.6400 - auc: 0.829812/44 [=======>......................] - ETA: 22s - loss: 0.4804 - accuracy: 0.7708 - precision: 0.7054 - recall: 0.6454 - auc: 0.844713/44 [=======>......................] - ETA: 21s - loss: 0.4675 - accuracy: 0.7788 - precision: 0.7042 - recall: 0.6667 - auc: 0.854014/44 [========>.....................] - ETA: 20s - loss: 0.4508 - accuracy: 0.7879 - precision: 0.7161 - recall: 0.6852 - auc: 0.865215/44 [=========>....................] - ETA: 19s - loss: 0.4431 - accuracy: 0.7937 - precision: 0.7143 - recall: 0.7018 - auc: 0.871316/44 [=========>....................] - ETA: 19s - loss: 0.4281 - accuracy: 0.8027 - precision: 0.7312 - recall: 0.7273 - auc: 0.881417/44 [==========>...................] - ETA: 18s - loss: 0.4112 - accuracy: 0.8125 - precision: 0.7449 - recall: 0.7374 - auc: 0.889818/44 [===========>..................] - ETA: 17s - loss: 0.4123 - accuracy: 0.8142 - precision: 0.7524 - recall: 0.7346 - auc: 0.890119/44 [===========>..................] - ETA: 17s - loss: 0.4105 - accuracy: 0.8158 - precision: 0.7583 - recall: 0.7240 - auc: 0.891620/44 [============>.................] - ETA: 16s - loss: 0.3963 - accuracy: 0.8234 - precision: 0.7668 - recall: 0.7371 - auc: 0.898721/44 [=============>................] - ETA: 15s - loss: 0.4066 - accuracy: 0.8199 - precision: 0.7650 - recall: 0.7306 - auc: 0.895422/44 [==============>...............] - ETA: 15s - loss: 0.4139 - accuracy: 0.8168 - precision: 0.7529 - recall: 0.7442 - auc: 0.892523/44 [==============>...............] - ETA: 14s - loss: 0.4127 - accuracy: 0.8152 - precision: 0.7378 - recall: 0.7490 - auc: 0.891624/44 [===============>..............] - ETA: 13s - loss: 0.4065 - accuracy: 0.8190 - precision: 0.7410 - recall: 0.7546 - auc: 0.893925/44 [================>.............] - ETA: 12s - loss: 0.4032 - accuracy: 0.8188 - precision: 0.7457 - recall: 0.7535 - auc: 0.895626/44 [================>.............] - ETA: 12s - loss: 0.3966 - accuracy: 0.8221 - precision: 0.7492 - recall: 0.7542 - auc: 0.898127/44 [=================>............] - ETA: 11s - loss: 0.3978 - accuracy: 0.8218 - precision: 0.7508 - recall: 0.7459 - auc: 0.897528/44 [==================>...........] - ETA: 10s - loss: 0.4042 - accuracy: 0.8192 - precision: 0.7524 - recall: 0.7287 - auc: 0.894829/44 [==================>...........] - ETA: 10s - loss: 0.3963 - accuracy: 0.8244 - precision: 0.7548 - recall: 0.7337 - auc: 0.897630/44 [===================>..........] - ETA: 9s - loss: 0.3925 - accuracy: 0.8260 - precision: 0.7554 - recall: 0.7395 - auc: 0.8992 31/44 [====================>.........] - ETA: 8s - loss: 0.3884 - accuracy: 0.8266 - precision: 0.7552 - recall: 0.7420 - auc: 0.901032/44 [====================>.........] - ETA: 8s - loss: 0.3841 - accuracy: 0.8281 - precision: 0.7536 - recall: 0.7450 - auc: 0.902433/44 [=====================>........] - ETA: 7s - loss: 0.3797 - accuracy: 0.8324 - precision: 0.7611 - recall: 0.7507 - auc: 0.904634/44 [======================>.......] - ETA: 6s - loss: 0.3809 - accuracy: 0.8318 - precision: 0.7587 - recall: 0.7527 - auc: 0.904235/44 [======================>.......] - ETA: 6s - loss: 0.3827 - accuracy: 0.8313 - precision: 0.7592 - recall: 0.7494 - auc: 0.903536/44 [=======================>......] - ETA: 5s - loss: 0.3829 - accuracy: 0.8333 - precision: 0.7646 - recall: 0.7531 - auc: 0.903837/44 [========================>.....] - ETA: 4s - loss: 0.3824 - accuracy: 0.8319 - precision: 0.7656 - recall: 0.7451 - auc: 0.903938/44 [========================>.....] - ETA: 4s - loss: 0.3769 - accuracy: 0.8355 - precision: 0.7735 - recall: 0.7518 - auc: 0.906739/44 [=========================>....] - ETA: 3s - loss: 0.3719 - accuracy: 0.8389 - precision: 0.7791 - recall: 0.7596 - auc: 0.908940/44 [==========================>...] - ETA: 2s - loss: 0.3662 - accuracy: 0.8422 - precision: 0.7838 - recall: 0.7665 - auc: 0.911241/44 [==========================>...] - ETA: 2s - loss: 0.3644 - accuracy: 0.8430 - precision: 0.7841 - recall: 0.7672 - auc: 0.911642/44 [===========================>..] - ETA: 1s - loss: 0.3618 - accuracy: 0.8452 - precision: 0.7857 - recall: 0.7691 - auc: 0.912643/44 [============================>.] - ETA: 0s - loss: 0.3590 - accuracy: 0.8459 - precision: 0.7868 - recall: 0.7672 - auc: 0.913744/44 [==============================] - ETA: 0s - loss: 0.3591 - accuracy: 0.8463 - precision: 0.7890 - recall: 0.7648 - auc: 0.913644/44 [==============================] - 39s 760ms/step - loss: 0.3591 - accuracy: 0.8463 - precision: 0.7890 - recall: 0.7648 - auc: 0.9136 - val_loss: 0.2944 - val_accuracy: 0.8737 - val_precision: 0.6612 - val_recall: 0.7843 - val_auc: 0.9456
Epoch 2/24
 1/44 [..............................] - ETA: 33s - loss: 0.1024 - accuracy: 0.9688 - precision: 1.0000 - recall: 0.9231 - auc: 0.9960 2/44 [>.............................] - ETA: 27s - loss: 0.1500 - accuracy: 0.9375 - precision: 0.9130 - recall: 0.9130 - auc: 0.9846 3/44 [=>............................] - ETA: 28s - loss: 0.1199 - accuracy: 0.9479 - precision: 0.9268 - recall: 0.9500 - auc: 0.9915 4/44 [=>............................] - ETA: 27s - loss: 0.1804 - accuracy: 0.9375 - precision: 0.8750 - recall: 0.9545 - auc: 0.9759 5/44 [==>...........................] - ETA: 26s - loss: 0.1850 - accuracy: 0.9312 - precision: 0.8730 - recall: 0.9483 - auc: 0.9750 6/44 [===>..........................] - ETA: 25s - loss: 0.1682 - accuracy: 0.9375 - precision: 0.8846 - recall: 0.9583 - auc: 0.9800 7/44 [===>..........................] - ETA: 25s - loss: 0.1656 - accuracy: 0.9420 - precision: 0.8977 - recall: 0.9518 - auc: 0.9800 8/44 [====>.........................] - ETA: 24s - loss: 0.2109 - accuracy: 0.9258 - precision: 0.9022 - recall: 0.8925 - auc: 0.9691 9/44 [=====>........................] - ETA: 23s - loss: 0.2202 - accuracy: 0.9236 - precision: 0.8857 - recall: 0.9029 - auc: 0.967510/44 [=====>........................] - ETA: 22s - loss: 0.2153 - accuracy: 0.9219 - precision: 0.8803 - recall: 0.9035 - auc: 0.969411/44 [======>.......................] - ETA: 22s - loss: 0.2083 - accuracy: 0.9233 - precision: 0.8906 - recall: 0.8976 - auc: 0.971212/44 [=======>......................] - ETA: 21s - loss: 0.2010 - accuracy: 0.9271 - precision: 0.8986 - recall: 0.8986 - auc: 0.972713/44 [=======>......................] - ETA: 20s - loss: 0.2010 - accuracy: 0.9303 - precision: 0.9048 - recall: 0.8986 - auc: 0.970914/44 [========>.....................] - ETA: 20s - loss: 0.1980 - accuracy: 0.9286 - precision: 0.9038 - recall: 0.8924 - auc: 0.972315/44 [=========>....................] - ETA: 19s - loss: 0.1967 - accuracy: 0.9312 - precision: 0.9118 - recall: 0.8960 - auc: 0.972216/44 [=========>....................] - ETA: 18s - loss: 0.1988 - accuracy: 0.9316 - precision: 0.9116 - recall: 0.8967 - auc: 0.970917/44 [==========>...................] - ETA: 17s - loss: 0.1958 - accuracy: 0.9301 - precision: 0.9010 - recall: 0.9010 - auc: 0.971018/44 [===========>..................] - ETA: 17s - loss: 0.1963 - accuracy: 0.9288 - precision: 0.8976 - recall: 0.9020 - auc: 0.971319/44 [===========>..................] - ETA: 16s - loss: 0.1893 - accuracy: 0.9326 - precision: 0.9014 - recall: 0.9057 - auc: 0.972220/44 [============>.................] - ETA: 16s - loss: 0.1893 - accuracy: 0.9328 - precision: 0.9058 - recall: 0.9018 - auc: 0.972521/44 [=============>................] - ETA: 15s - loss: 0.1828 - accuracy: 0.9360 - precision: 0.9095 - recall: 0.9056 - auc: 0.973822/44 [==============>...............] - ETA: 14s - loss: 0.1765 - accuracy: 0.9389 - precision: 0.9139 - recall: 0.9102 - auc: 0.975423/44 [==============>...............] - ETA: 14s - loss: 0.1760 - accuracy: 0.9389 - precision: 0.9173 - recall: 0.9066 - auc: 0.975924/44 [===============>..............] - ETA: 13s - loss: 0.1702 - accuracy: 0.9414 - precision: 0.9211 - recall: 0.9108 - auc: 0.977225/44 [================>.............] - ETA: 12s - loss: 0.1731 - accuracy: 0.9413 - precision: 0.9214 - recall: 0.9117 - auc: 0.976926/44 [================>.............] - ETA: 12s - loss: 0.1696 - accuracy: 0.9423 - precision: 0.9207 - recall: 0.9144 - auc: 0.977927/44 [=================>............] - ETA: 11s - loss: 0.1649 - accuracy: 0.9433 - precision: 0.9200 - recall: 0.9169 - auc: 0.978928/44 [==================>...........] - ETA: 10s - loss: 0.1643 - accuracy: 0.9442 - precision: 0.9216 - recall: 0.9156 - auc: 0.978829/44 [==================>...........] - ETA: 10s - loss: 0.1608 - accuracy: 0.9450 - precision: 0.9214 - recall: 0.9185 - auc: 0.979630/44 [===================>..........] - ETA: 9s - loss: 0.1608 - accuracy: 0.9448 - precision: 0.9177 - recall: 0.9205 - auc: 0.9800 31/44 [====================>.........] - ETA: 8s - loss: 0.1633 - accuracy: 0.9446 - precision: 0.9201 - recall: 0.9174 - auc: 0.978432/44 [====================>.........] - ETA: 8s - loss: 0.1602 - accuracy: 0.9453 - precision: 0.9226 - recall: 0.9174 - auc: 0.979333/44 [=====================>........] - ETA: 7s - loss: 0.1567 - accuracy: 0.9470 - precision: 0.9258 - recall: 0.9208 - auc: 0.980334/44 [======================>.......] - ETA: 6s - loss: 0.1574 - accuracy: 0.9467 - precision: 0.9239 - recall: 0.9189 - auc: 0.980235/44 [======================>.......] - ETA: 5s - loss: 0.1587 - accuracy: 0.9455 - precision: 0.9239 - recall: 0.9167 - auc: 0.980436/44 [=======================>......] - ETA: 5s - loss: 0.1566 - accuracy: 0.9462 - precision: 0.9264 - recall: 0.9171 - auc: 0.981137/44 [========================>.....] - ETA: 4s - loss: 0.1570 - accuracy: 0.9459 - precision: 0.9246 - recall: 0.9201 - auc: 0.981438/44 [========================>.....] - ETA: 4s - loss: 0.1544 - accuracy: 0.9465 - precision: 0.9238 - recall: 0.9216 - auc: 0.982039/44 [=========================>....] - ETA: 3s - loss: 0.1549 - accuracy: 0.9455 - precision: 0.9233 - recall: 0.9190 - auc: 0.982140/44 [==========================>...] - ETA: 2s - loss: 0.1554 - accuracy: 0.9453 - precision: 0.9236 - recall: 0.9195 - auc: 0.982241/44 [==========================>...] - ETA: 2s - loss: 0.1617 - accuracy: 0.9428 - precision: 0.9174 - recall: 0.9194 - auc: 0.981042/44 [===========================>..] - ETA: 1s - loss: 0.1635 - accuracy: 0.9420 - precision: 0.9137 - recall: 0.9214 - auc: 0.980743/44 [============================>.] - ETA: 0s - loss: 0.1629 - accuracy: 0.9426 - precision: 0.9155 - recall: 0.9212 - auc: 0.980744/44 [==============================] - ETA: 0s - loss: 0.1612 - accuracy: 0.9435 - precision: 0.9167 - recall: 0.9223 - auc: 0.981044/44 [==============================] - 33s 740ms/step - loss: 0.1612 - accuracy: 0.9435 - precision: 0.9167 - recall: 0.9223 - auc: 0.9810 - val_loss: 0.2772 - val_accuracy: 0.8818 - val_precision: 0.7312 - val_recall: 0.6667 - val_auc: 0.9281
Epoch 3/24
 1/44 [..............................] - ETA: 27s - loss: 0.1775 - accuracy: 0.9062 - precision: 0.8889 - recall: 0.8000 - auc: 0.9864 2/44 [>.............................] - ETA: 27s - loss: 0.0990 - accuracy: 0.9531 - precision: 0.9231 - recall: 0.8571 - auc: 0.9957 3/44 [=>............................] - ETA: 26s - loss: 0.1095 - accuracy: 0.9583 - precision: 0.9600 - recall: 0.8889 - auc: 0.9976 4/44 [=>............................] - ETA: 25s - loss: 0.0880 - accuracy: 0.9688 - precision: 0.9722 - recall: 0.9211 - auc: 0.9987 5/44 [==>...........................] - ETA: 25s - loss: 0.0816 - accuracy: 0.9688 - precision: 0.9792 - recall: 0.9216 - auc: 0.9990 6/44 [===>..........................] - ETA: 24s - loss: 0.1089 - accuracy: 0.9583 - precision: 0.9500 - recall: 0.9194 - auc: 0.9953 7/44 [===>..........................] - ETA: 24s - loss: 0.1037 - accuracy: 0.9554 - precision: 0.9315 - recall: 0.9315 - auc: 0.9949 8/44 [====>.........................] - ETA: 23s - loss: 0.1291 - accuracy: 0.9453 - precision: 0.9222 - recall: 0.9222 - auc: 0.9891 9/44 [=====>........................] - ETA: 23s - loss: 0.1178 - accuracy: 0.9514 - precision: 0.9320 - recall: 0.9320 - auc: 0.991010/44 [=====>........................] - ETA: 22s - loss: 0.1070 - accuracy: 0.9563 - precision: 0.9381 - recall: 0.9381 - auc: 0.992511/44 [======>.......................] - ETA: 21s - loss: 0.1210 - accuracy: 0.9545 - precision: 0.9365 - recall: 0.9365 - auc: 0.990212/44 [=======>......................] - ETA: 20s - loss: 0.1131 - accuracy: 0.9583 - precision: 0.9420 - recall: 0.9420 - auc: 0.991113/44 [=======>......................] - ETA: 20s - loss: 0.1089 - accuracy: 0.9591 - precision: 0.9404 - recall: 0.9467 - auc: 0.991714/44 [========>.....................] - ETA: 19s - loss: 0.1061 - accuracy: 0.9598 - precision: 0.9455 - recall: 0.9455 - auc: 0.992215/44 [=========>....................] - ETA: 18s - loss: 0.1062 - accuracy: 0.9604 - precision: 0.9489 - recall: 0.9435 - auc: 0.992416/44 [=========>....................] - ETA: 18s - loss: 0.1123 - accuracy: 0.9609 - precision: 0.9521 - recall: 0.9421 - auc: 0.989717/44 [==========>...................] - ETA: 17s - loss: 0.1183 - accuracy: 0.9596 - precision: 0.9554 - recall: 0.9369 - auc: 0.989618/44 [===========>..................] - ETA: 16s - loss: 0.1137 - accuracy: 0.9601 - precision: 0.9535 - recall: 0.9404 - auc: 0.990219/44 [===========>..................] - ETA: 16s - loss: 0.1215 - accuracy: 0.9572 - precision: 0.9430 - recall: 0.9430 - auc: 0.989120/44 [============>.................] - ETA: 15s - loss: 0.1246 - accuracy: 0.9547 - precision: 0.9328 - recall: 0.9447 - auc: 0.988721/44 [=============>................] - ETA: 14s - loss: 0.1205 - accuracy: 0.9568 - precision: 0.9363 - recall: 0.9476 - auc: 0.989222/44 [==============>...............] - ETA: 14s - loss: 0.1169 - accuracy: 0.9588 - precision: 0.9377 - recall: 0.9488 - auc: 0.989523/44 [==============>...............] - ETA: 13s - loss: 0.1170 - accuracy: 0.9592 - precision: 0.9366 - recall: 0.9508 - auc: 0.989524/44 [===============>..............] - ETA: 13s - loss: 0.1254 - accuracy: 0.9557 - precision: 0.9399 - recall: 0.9399 - auc: 0.988825/44 [================>.............] - ETA: 12s - loss: 0.1211 - accuracy: 0.9575 - precision: 0.9418 - recall: 0.9418 - auc: 0.989426/44 [================>.............] - ETA: 11s - loss: 0.1193 - accuracy: 0.9579 - precision: 0.9400 - recall: 0.9431 - auc: 0.989527/44 [=================>............] - ETA: 11s - loss: 0.1169 - accuracy: 0.9583 - precision: 0.9385 - recall: 0.9446 - auc: 0.989828/44 [==================>...........] - ETA: 10s - loss: 0.1142 - accuracy: 0.9598 - precision: 0.9399 - recall: 0.9459 - auc: 0.990029/44 [==================>...........] - ETA: 9s - loss: 0.1116 - accuracy: 0.9612 - precision: 0.9417 - recall: 0.9475 - auc: 0.9904 30/44 [===================>..........] - ETA: 9s - loss: 0.1137 - accuracy: 0.9604 - precision: 0.9381 - recall: 0.9493 - auc: 0.990131/44 [====================>.........] - ETA: 8s - loss: 0.1142 - accuracy: 0.9607 - precision: 0.9395 - recall: 0.9477 - auc: 0.990132/44 [====================>.........] - ETA: 7s - loss: 0.1110 - accuracy: 0.9619 - precision: 0.9405 - recall: 0.9486 - auc: 0.990533/44 [=====================>........] - ETA: 7s - loss: 0.1089 - accuracy: 0.9621 - precision: 0.9396 - recall: 0.9500 - auc: 0.990934/44 [======================>.......] - ETA: 6s - loss: 0.1070 - accuracy: 0.9623 - precision: 0.9415 - recall: 0.9491 - auc: 0.991235/44 [======================>.......] - ETA: 5s - loss: 0.1067 - accuracy: 0.9616 - precision: 0.9433 - recall: 0.9457 - auc: 0.991336/44 [=======================>......] - ETA: 5s - loss: 0.1042 - accuracy: 0.9627 - precision: 0.9447 - recall: 0.9471 - auc: 0.991737/44 [========================>.....] - ETA: 4s - loss: 0.1017 - accuracy: 0.9637 - precision: 0.9465 - recall: 0.9488 - auc: 0.992038/44 [========================>.....] - ETA: 3s - loss: 0.1000 - accuracy: 0.9638 - precision: 0.9458 - recall: 0.9502 - auc: 0.992339/44 [=========================>....] - ETA: 3s - loss: 0.1002 - accuracy: 0.9639 - precision: 0.9469 - recall: 0.9491 - auc: 0.992340/44 [==========================>...] - ETA: 2s - loss: 0.1055 - accuracy: 0.9625 - precision: 0.9458 - recall: 0.9458 - auc: 0.991341/44 [==========================>...] - ETA: 1s - loss: 0.1031 - accuracy: 0.9634 - precision: 0.9471 - recall: 0.9471 - auc: 0.991642/44 [===========================>..] - ETA: 1s - loss: 0.1044 - accuracy: 0.9628 - precision: 0.9444 - recall: 0.9485 - auc: 0.991543/44 [============================>.] - ETA: 0s - loss: 0.1031 - accuracy: 0.9629 - precision: 0.9442 - recall: 0.9501 - auc: 0.991744/44 [==============================] - ETA: 0s - loss: 0.1018 - accuracy: 0.9635 - precision: 0.9451 - recall: 0.9509 - auc: 0.991944/44 [==============================] - 32s 720ms/step - loss: 0.1018 - accuracy: 0.9635 - precision: 0.9451 - recall: 0.9509 - auc: 0.9919 - val_loss: 0.4425 - val_accuracy: 0.8778 - val_precision: 0.6847 - val_recall: 0.7451 - val_auc: 0.9253
 1/16 [>.............................] - ETA: 3s - loss: 0.3047 - accuracy: 0.8438 - precision: 0.5000 - recall: 0.4000 - auc: 0.9556 2/16 [==>...........................] - ETA: 2s - loss: 0.2056 - accuracy: 0.8906 - precision: 0.6923 - recall: 0.7500 - auc: 0.9736 3/16 [====>.........................] - ETA: 2s - loss: 0.3178 - accuracy: 0.8646 - precision: 0.6818 - recall: 0.7143 - auc: 0.9451 4/16 [======>.......................] - ETA: 2s - loss: 0.2862 - accuracy: 0.8750 - precision: 0.7222 - recall: 0.8125 - auc: 0.9552 5/16 [========>.....................] - ETA: 2s - loss: 0.2631 - accuracy: 0.8875 - precision: 0.7381 - recall: 0.8158 - auc: 0.9583 6/16 [==========>...................] - ETA: 2s - loss: 0.2764 - accuracy: 0.8854 - precision: 0.7358 - recall: 0.8298 - auc: 0.9561 7/16 [============>.................] - ETA: 1s - loss: 0.3181 - accuracy: 0.8750 - precision: 0.7143 - recall: 0.8182 - auc: 0.9485 8/16 [==============>...............] - ETA: 1s - loss: 0.3025 - accuracy: 0.8789 - precision: 0.7000 - recall: 0.8305 - auc: 0.9513 9/16 [===============>..............] - ETA: 1s - loss: 0.3099 - accuracy: 0.8646 - precision: 0.6500 - recall: 0.8254 - auc: 0.946510/16 [=================>............] - ETA: 1s - loss: 0.3012 - accuracy: 0.8687 - precision: 0.6667 - recall: 0.8000 - auc: 0.947211/16 [===================>..........] - ETA: 1s - loss: 0.3048 - accuracy: 0.8665 - precision: 0.6522 - recall: 0.8000 - auc: 0.944712/16 [=====================>........] - ETA: 0s - loss: 0.3034 - accuracy: 0.8646 - precision: 0.6500 - recall: 0.7927 - auc: 0.945113/16 [=======================>......] - ETA: 0s - loss: 0.2960 - accuracy: 0.8702 - precision: 0.6636 - recall: 0.7978 - auc: 0.947614/16 [=========================>....] - ETA: 0s - loss: 0.2846 - accuracy: 0.8750 - precision: 0.6667 - recall: 0.7826 - auc: 0.948315/16 [===========================>..] - ETA: 0s - loss: 0.2882 - accuracy: 0.8771 - precision: 0.6579 - recall: 0.7895 - auc: 0.946416/16 [==============================] - ETA: 0s - loss: 0.2944 - accuracy: 0.8737 - precision: 0.6612 - recall: 0.7843 - auc: 0.945616/16 [==============================] - 3s 196ms/step - loss: 0.2944 - accuracy: 0.8737 - precision: 0.6612 - recall: 0.7843 - auc: 0.9456


Loss: 0.29439955949783325
Accuracy: 0.8737474679946899
Precision: 0.6611570119857788
Recall: 0.7843137383460999
F1 score: 0.717488787075413
